# SQL and SQLite3 basics
Mostly this will cover the SQL language in reference to Python. Since SQL is universal most of this can be used wherever you use SQL.





- *Syntax note:*

Tradition says to have the SQL commands in UPPERCASE, but modern programmers usually do not do this. Modern programming has all of the SQL commands in lowercase. 
  - This is due to SQL not being case sensitive,  and possibly: ease of typing, easier on the eyes and easier to understand.  Pick however you feel comfortable with it (or whatever if required of you) and stick with it
  
[ Docs from SQLite.com](https://www.sqlite.org/docs.html)
[ Docs from Microsoft](https://docs.microsoft.com/en-us/sql/?view=sql-server-2017)
[SQL cheat sheet](http://www.cheat-sheets.org/sites/sql.su/)

In [0]:
import sqlite3

In [0]:
!pip install jupyter_contrib_nbextensions

In [0]:
!jupyter contrib nbextension install --user

In [0]:
# to create a database (or connect to the database if it's already created)

db_conn = sqlite3.connect('test.db')

In [0]:
# a cursor allows you to go through the database
# you can think of this like the mouse cursor
cursor = db_conn.cursor()

SQL syntax:
 - CREATE TABLE 
    - creates a table with whatever you name it right after this command, what is in the () will be parameters you want this table to contain
 - IF NOT EXISTS
    - meaning, if the table already exists, no need to make it again
 - ID INTEGER PRIMARY KEY AUTOINCREMENT NOT NULL
    - this means each entry into the table will have a unique id, used as a primary key (meaning how you can reference table entries), which will be automatically incremented so you don't have to manually do that for new entries and also it has to have a value (NOT NULL)

- Then it goes through and gives column names, data types and restrictions on each.



Syntax is important, this is almost like typing it directly into a SQL shell:
For example in the shell, you would execute this command like so:

```
create table TableName(ID integer primary key autoincrement not null, FirstColumnAfterID text not null, SecondColumnAfterID int not null);
```

  
## Type of datatypes accepted in SQLite:   
 
 
  - TEXT
    - Text input, will convert this into a string
 - NUMERIC    
    - 
 - INTEGER
    - Whole numbers only
  - REAL
    - Real decimal numbers only, from - 3.40E + 38 to -1.18E - 38, 0 and 1.18E - 38 to 3.40E + 38
 - BLOB
    - Binary Large Object (can be used for pictures, among other datatypes)
 
 
 

---


 
 ### Types of datatypes in SQL 
 *NOTE: In SQLite3, all datatypes will be converted into one of the 5 datatypes explained above*
 - TEXT
    - accepts text input, will convert this into a string
 - INTEGER or INT
    - Whole numbers only
 - FLOAT(\[n])
    - Floating point number
    - The precision of the floating point value is 7 digits if  1 <= n <= 24
    - The precision of the floating point value is 15 digits if 25 <= n <= 53
    - where if 1 <= n <= 24, n is treated as 24 and if 25<=n<=53 then n is treated as 53
 - REAL, DOUBLE, DOUBLE PRECISION
    - Real decimal numbers only, from - 3.40E + 38 to -1.18E - 38, 0 and 1.18E - 38 to 3.40E + 38
 - DATE(yyyymmdd)
    - Holds a date
 - CHAR(n)
    - Fixed length string, if no "n" is specified, length is one
 - VARCHAR(n)
   - Variable length string
 - BLOB
    - Binary Large Object

## Comparison Expressions from SQLite.org docs:

> SQLite version 3 has the usual set of SQL comparison operators including "=", "==", "<", "<=", ">", ">=", "!=", "", "IN", "NOT IN", "BETWEEN", "IS", and "IS NOT",

In [6]:
db_conn.execute("CREATE TABLE IF NOT EXISTS Humans(ID INTEGER PRIMARY KEY AUTOINCREMENT NOT NULL,\
                  FirstName TEXT NOT NULL, \
                LastName TEXT NOT NULL, \
                Age INTEGER NOT NULL, \
                Phone INTEGER, \
                Weight REAL, \
                BirthDate TEXT);")

In [0]:
# after you "execute" a command, you have to commit the changes 
# to the database or they will not take affect
db_conn.commit()

## Python syntax note:


It's good practice to put SQL execution code into try blocks just in case something goes wrong ( this way you're not making multiple tables or overriding something, ect).


For example:



```
try:

      db_conn.execute("create table TableName(ID integer primary key autoincrement not null, FirstColumnAfterID text not null);")
    
      db_conn.commit()
      
except sqlite3.OperationalError:
      print("Table couldn't be created, fix it plzzz")
```

## Inserting into the Table



SQL syntax:
```
insert into TableName(FirstColumnAfterID, SecondColumnAfterID) values ("Words", 1234);
```

In [0]:
# inserting data into the database
# notice how ID is not in here, this is because it'll "autoincrement" it 
db_conn.execute("INSERT INTO Humans (FirstName, LastName, \
                                    Age, Phone, Weight, \
                                    BirthDate) VALUES ('Billy', \
                                    'Goat', 25,4562314, 175,\
                                     date('now'));")
db_conn.commit()

In [0]:
# Adding more entries to play with
db_conn.execute("INSERT INTO Humans (FirstName, LastName, \
                                    Age, Phone, Weight, BirthDate)\
                            VALUES ('Jilly', 'Boat',\
                                    54, 5562314, 125.25,\
                                    date('now'));")

db_conn.execute("INSERT INTO Humans (FirstName, LastName, \
                                    Age, Phone, Weight, BirthDate)\
                            VALUES ('Hilly', 'Goal',\
                                    25, 4562954, 175.99,\
                                    date('now'));")
db_conn.commit()

## Viewing the Table (By Row)

SQL syntax:


```
select id, FirstColumnAfterID, SecondColumnAfterID from TableName; 
```

In [0]:
# writing a funciton to have the database table print out, 
# this will print each grouping of entry one at a time (just for the visuals)

def print_database_info():
  try:
    result = cursor.execute("SELECT ID, \
    FirstName, \
    LastName , \
    Age, \
    Phone, \
    Weight, \
    BirthDate FROM Humans")

# looping over the entire table and printing out the data    
    for row in result:
      print(f"""ID : {row[0]}, FirstName : {row[1]}, LastName : {row[2]}\n      
Age : {row[3]}, Phone : {row[4]},\n
Weight : {row[5]}, BirthDate : {row[6]}\n""")

      # having an exception block to catch any errors      
  except sqlite3.OperationalError:
      print("Database does't exist")

In [18]:
# notice how Weight is decimal placed number
print_database_info()

ID : 1, FirstName : Billy, LastName : Goat

Age : 25, Phone : 4562314,

Weight : 175.0, BirthDate : 2019-02-28

ID : 2, FirstName : Jilly, LastName : Boat

Age : 54, Phone : 5562314,

Weight : 125.25, BirthDate : 2019-02-28

ID : 3, FirstName : Hilly, LastName : Goal

Age : 25, Phone : 4562954,

Weight : 175.99, BirthDate : 2019-02-28

## Viewing the Table (By Column Headers)

SQL syntax:


```
pragma table_info(TableName);
```

In [19]:
cursor.execute("PRAGMA TABLE_INFO(Humans)")

In [20]:
columnNames = [name[1] for name in cursor.fetchall()]
columnNames

['ID', 'FirstName', 'LastName', 'Age', 'Phone', 'Weight', 'BirthDate']

## Grabbing

## Updating the Table info

SQL syntax:



```
update TableName set SecondColumnAfterID=4321 where FirstColumnAfterID="Words";
```

In [21]:
try:
  db_conn.execute("UPDATE Humans SET FirstName = 'Stephen' WHERE ID=1")
  db_conn.commit()
except sqlite3.OperationalError:
    print("Table wasn't able to update, why?")

# printing the database to see the changes
print_database_info()

ID : 1, FirstName : Stephen, LastName : Goat

Age : 25, Phone : 4562314,

Weight : 175.0, BirthDate : 2019-02-28

ID : 2, FirstName : Jilly, LastName : Boat

Age : 54, Phone : 5562314,

Weight : 125.25, BirthDate : 2019-02-28

ID : 3, FirstName : Hilly, LastName : Goal

Age : 25, Phone : 4562954,

Weight : 175.99, BirthDate : 2019-02-28

## Oops, want to go back as if that last action never occured? (Python specific code)

In [0]:
db_conn.rollback()

In [26]:
help(sqlite3.rollback())

AttributeError: ignored

In [23]:
print_database_info()

ID : 1, FirstName : Stephen, LastName : Goat

Age : 25, Phone : 4562314,

Weight : 175.0, BirthDate : 2019-02-28

ID : 2, FirstName : Jilly, LastName : Boat

Age : 54, Phone : 5562314,

Weight : 125.25, BirthDate : 2019-02-28

ID : 3, FirstName : Hilly, LastName : Goal

Age : 25, Phone : 4562954,

Weight : 175.99, BirthDate : 2019-02-28

## Delete Table row

SQL syntax:



```
delete from TableName where FirstColumnAfterID = "Words";
```

In [27]:
try:
  db_conn.execute("DELETE FROM Humans WHERE ID=1;")
  db_conn.commit()
except sqlite3.OperationalError:
    print("Table wasn't able to update, why?")

# printing the database to see the changes
print_database_info()

ID : 2, FirstName : Jilly, LastName : Boat

Age : 54, Phone : 5562314,

Weight : 125.25, BirthDate : 2019-02-28

ID : 3, FirstName : Hilly, LastName : Goal

Age : 25, Phone : 4562954,

Weight : 175.99, BirthDate : 2019-02-28

## Add new column to table

SQL syntax:
 
 

```
alter table TableName add column 'NewColumn' text default null
```

In [0]:
try:
  db_conn.execute("ALTER TABLE Humans ADD COLUMN 'Picture' BLOB DEFAULT NULL")
  db_conn.commit()
except sqlite3.OperationalError:
    print("Table wasn't able to update, why?")

In [29]:
# verifying it worked
cursor.execute("PRAGMA TABLE_INFO(Humans)")
columnNames = [name[1] for name in cursor.fetchall()]
columnNames

['ID',
 'FirstName',
 'LastName',
 'Age',
 'Phone',
 'Weight',
 'BirthDate',
 'Picture']

## Delete column in a table

SQL syntax:
 
 

```
alter table TableName drop column 'NewColumn' text default null;
```

In [67]:
try:
  db_conn.execute("ALTER TABLE Humans DROP COLUMN 'Weight' REAL;")
  db_conn.commit()
except sqlite3.OperationalError:
    print("Table wasn't able to update, why?")

Table wasn't able to update, why?

In [0]:
# verifying it worked
cursor.execute("PRAGMA TABLE_INFO(Humans)")
columnNames = [name[1] for name in cursor.fetchall()]
columnNames

## Delete index in a table

SQL syntax:
 
 

```
drop index TableName.index_name;
```

## Create Database

SQL synatx:



```
create database DatabaseName;
```

## Delete entire table

SQL syntax:



```
drop table if exists TableName;
```

In [0]:
# need to delete an entire table?
db_conn.execute("DROP TABLE IF EXISTS Humans")
db_conn.commit()

## Close the database connection when you're done!

In [0]:
# after you're done editing your database, make sure to close the connection
db_conn.close()

## Get all of the SQL steps to recreate the entire database (with Python and SQLite3)

In [0]:
# this saves a .sql file that has all of the steps to create this table

with open('dump.sql', 'w') as f:
  for line in db_conn.iterdump():
    f.write("%s\n" % line)

## Download the SQLite3 Database with Pandas

Python syntax:

To grab the entire database:

```
pandas.read_sql_query("select * from TableName;", db_conn)
```


read_sql_query() syntax:

`read_sql_query("SQL query; ", connection_to_database)`

In [0]:
import pandas as pd

In [0]:
# conect to the database you want

db_conn = sqlite3.connect('test.db')

# add your cursor
cursor = db_conn.cursor()

In [33]:
# select everything from the database

cursor.execute("select * from Humans;")
human_results = cursor.fetchall()
print(human_results)

[(2, 'Jilly', 'Boat', 54, 5562314, 125.25, '2019-02-28', None), (3, 'Hilly', 'Goal', 25, 4562954, 175.99, '2019-02-28', None)]

In [0]:
names_numbers = cursor.execute("""
  select cast(FirstName as text),
  cast(Phone as integer)
  from Humans;""").fetchall()

In [39]:
names_numbers

[('Jilly', 5562314), ('Hilly', 4562954)]

In [40]:
df = pd.read_sql_query("select * from Humans;", db_conn)
df

   ID FirstName LastName  Age    Phone  Weight   BirthDate Picture
0   2     Jilly     Boat   54  5562314  125.25  2019-02-28    None
1   3     Hilly     Goal   25  4562954  175.99  2019-02-28    None

## Close the database connection when you're done!

In [0]:
# after you're done editing your database, make sure to close the connection
db_conn.close()